const engineer = [
    {
        pic:"./img/job/fe.png",
        title:'前端开发工程师',
        text:'会coding的设计师、懂设计的程序猿。各大网站每天上万条招聘信息，快速入门 IT行业的不二之选。',
        counttime:'总时长182小时',
        people:'13785人学习',
        station:'前端工程师是目前非常受欢迎的一个职业，生活中Web端页面和移动端的界面、微信中的小程序，以及pad等各种移动设备所看到的网页，都是由前端工程师做的。作为用户交互必不可少的环节，对前端工程师的需求量与日俱增，薪资水平日益高涨',
        skill:'能够熟练掌握HTML（5）、CSS（3）、JS ，运用主流框架进行项目开发，协同团队合作，提高工作效率，开发高性能网站。',
        more:'了解更多前端开发工程师',
    },
    {
        pic:"./img/job/java.png",
        title:'Java开发工程师',
        text:'综合就业排名第一的职位！每五行代码中，就有一行采用Java编写,大数据、云计算、人工智能等新兴方向再一次推动了Java工程师的职业发展。',
        counttime:'总时长138小时',
        people:'12279人学习',
        station:'大数据、云计算、人工智能等新兴方向再一次推动了Java工程师的职业发展。Java开发工程师涉及到多个领域，主要负责电商、医疗、金融、ERP、物流管理、App服务端等系统功能的开发和优化工作。',
        skill:'掌握必备的Java语法、前端和Java Web基础，掌握数据库开发及应用流行的SSM框架整合进行实战项目开发，达到企业用人需求。',
        more:'了解更多Java开发工程师',
    },
    {
        pic:"./img/job/android.png",
        title:'Android开发工程师',
        text:'Android：移动设备市场份额占据第一位。丰富的官方和第三方学习资料，降低学习成本，早日迈向高薪。',
        counttime:'总时长139小时',
        people:'4820人学习',
        station:'每个互联网公司和大部分传统公司都有自家的Android应用，为用户带来更好的用户体验。同时Android系统的应用范围不限于App开发，在智能电视、智能手表、智能车载设备等领域都有Android工程师的用武之地。',
        skill:'通过学习课程可以掌握Android网络/数据库/多媒体/蓝牙通讯等技术的开发，以及企业开发中常用的第三方框架的使用。',
        more:'了解更多Android开发工程师',
    },
    {
        pic:"./img/job/php.png",
        title:'PHP开发工程师',
        text:'PHP开发周期短、稳定、安全、简单易学、跨平台可扩展性强，国内80%以上的动态网站都在使用PHP技术。',
        counttime:'总时长123小时',
        people:'2897人学习',
        station:' PHP开发工程师是非常具有竞争性的岗位，就业前景广阔。PHP开发工程师主要从事Web/App后端开发工作。使用流行框架快速搭建企业项目架构，完成项目功能接口设计以及后台模块管理，并根据实际需求对项目进行维护和优化。',
        skill:'掌握PHP开发的必备技能。了解前端开发相关技术，能实现基本的页面呈现和 JavaScript 交互。使用流行框架，独立开发项目。',
        more:'了解更多PHP开发工程师',
    }
]
const first = [
    {
        con:"课程知识反复使用，更新速度慢"
    },
    {
        con:"讲师身份包装，水平参差不齐"
    },
    {
        con:"学完推荐入职，但不保证成功"
    },
]
const second = [
    {
        con:"课程缺乏设计，内容陈旧"
    },
    {
        con:"讲师自身技术水平难以保证"
    },
    {
        con:"夸大学习效果，实际难以落地入职"
    },
]
const third= [
    {
        con:"教学内容主流实用，与时俱进"
    },
    {
        con:"讲师均来自国内一线互联网公司"
    },
    {
        con:"课程技术接轨企业用人标准"
    },
]
const study = [
    {
        pic:"./img/job/web_part4_1@2x.png",
        title:"教学内容：结合企业需求",
        con:"根据企业需求、行业发展，系统设计的课程",
    },
    {
        pic:"./img/job/web_part4_2@2x.png",
        title:"教学方式：学练测评一体",
        con:"课程不只是讲课，练习，评测，作业一体化，学习、巩固都不能少",
    },
    {
        pic:"./img/job/web_part4_3@2x.png",
        title:"课程案例：案例作业丰富",
        con:"案例多为实际工作中常见、常用的让你能更贴近实际开发",
    },
    {
        pic:"./img/job/web_part4_4@2x.png",
        title:"教辅材料：大量辅助资料",
        con:"提供了大量的辅助资料，以帮助你更好的理解和扩充知识面",
    },
    {
        pic:"./img/job/web_part4_5@2x.png",
        title:"随到随学",
        con:"学习时间灵活自由，放学、下班皆可学习，任你做主",
    },
    {
        pic:"./img/job/web_part4_6@2x.png",
        title:"1V1作业批改",
        con:"阶段作业，1对1批改，指出问题、建议，切实提高你的代码能力程",
    },
    {
        pic:"./img/job/web_part4_7@2x.png",
        title:"答疑解惑",
        con:"课程设立专门的问答区，可随时提问，我们将悉心为你解答",
    },
    {
        pic:"./img/job/web_part4_8@2x.png",
        title:"代码下载",
        con:"讲课过程中的代码，你可随时下载到本地，供你练习使用",
    },
]
const student = [
    {
        pic:"./img/job/1.jpg",
        name:"杨颖",
        content:"把html和css的看完之后才来评价的，一说任课讲师:我买了3个慕课的付费课程，付费课程里面的老师无一例外特别负责任，讲的通俗易懂，带领学生把他的语法还有原理搞懂之后最后通过练习以及实战再回顾巩固所学知识，慕课的团队辛苦了，觉得慕课这家公司的企业文化应该特别棒，才能搞出来慕课这么棒的视频网站，真心佩服，粉，以后还会继续支持慕课的，加油啊，慕课的小伙伴们"
    },
    {
        pic:"./img/job/2.jpg",
        name:'杨幂',
        content:"老师还是很细节的。 有些使用小技巧啊约定俗成的规定啊都穿插在了课常内容中，那些才是精华，不能跳着看。另外感觉原视频速度已经被减慢过，全程2倍速。"
    },
    {
        pic:"./img/job/3.jpg",
        name:'赵丽颖',
        content:"真的不错原来我还犹豫了挺久的，出乎意料的可以。我更建议最好有点点基础再听会明白的更多"
    },
    {
        pic:"./img/job/4.jpg",
        name:'迪丽热巴',
        content:"我是有点点毛皮基础的，感觉性价比非常高，我在购买整套课程之前已经考虑了一个多月了，51cto呀北风网这些都看过了，不过最后还是选择了慕课，毕竟真的是良心课程，所以推荐入门的可以报，以后想进阶的在考虑其他呗"
    },
    {
        pic:"./img/job/5.jpg",
        name:'唐嫣',
        content:"学完了嘻嘻，可以说是很通俗易懂了，比我们学校老师讲的好很多。"
    },
    {
        pic:"./img/job/6.jpg",
        name:'唐艺昕',
        content:"讲的很不错，每小结都有自己独有的知识点，每个章节可以覆盖很多知识点，总体来讲真的很全面。课程也是不错，其实还是有一定基础的，现在来看看，正好可以巩固自己以前看书漏掉的知识，最有特点的就是课后习题，这一点我个人很喜欢。可能是习惯了吧，习惯听完课有题做的感觉，这样可以迅速的发现哪里自己存在问题，进行查漏补缺，总之课程很棒!"
    },
    {
        pic:"./img/job/7.jpg",
        name:'容祖儿',
        content:"非常好，老师讲的很有条理，学习起来很轻松，很值！跟免费的完全不一样，之前学了几天免费的，以为内容一样的就开了2倍速看，看了才知道知识点要多一些，又好好的重新学了一下，受益匪浅呀，哈哈！点赞！"
    },
    {
        pic:"./img/job/8.jpg",
        name:'宋祖儿',
        content:"言简意赅 条理清晰 没有废话 直入主题 节省时间 干货满满!"
    },
    {
        pic:"./img/job/9.jpg",
        name:'蓝盈盈',
        content:"授课老师思路清晰，讲解详略得当，课后作业点评认真，在慕课网上学习是一件很开心的事。花钱的课程比免费的好。"
    },
    {
        pic:"./img/job/10.jpg",
        name:'蔡卓妍',
        content:"我在慕课网上买过前端路径，对我帮助很大，课程真的很好，很实用，但是学到一半就找了份Java的工作，但是不慌，我第一时间又想到了慕课网，我坚信只要努力学习，慕课网一定可以帮助我搞定全部难题。老师很热心，我在面试的时候老师还给我发了很多面试题的链接，面试成功了，借这个机会谢谢慕课网的全体老师。"
    },
    {
        pic:"./img/job/11.jpg",
        name:'林志玲',
        content:"一下子买了前端路径的所有课程，比外面的培训机构便宜多了，而且内容充实，老师讲得也很细致，课后选择题、编程练习、课后作业都挺好的，不懂的也有老师解答，很喜欢。我是一个喜欢自学的人，这种根据自己的节奏学知识的感觉非常棒！也希望自己能继续努力，尽快学完现在的课程，也希望慕课能推出更多与就业接轨，与现在的新技术接轨的课程！自己还有一年多就要毕业了，加紧学习，希望能在毕业前找到份不错的工作。"
    },
    {
        pic:"./img/job/12.jpg",
        name:'宋佳',
        content:"之前学过一些H5和CSS3方面的知识，不是很多，只记住了一些主要的标签用法，在视频里面老师讲的特别细，同时里面的实例我感觉非常好，小例子举得挺多的，方便理解，让我重新把学过的只是归纳整理了。JS进阶我也觉得特别棒，给了我们整体的思路，不仅提升了自己，还更有了学习的欲望，而且老师有给点评和建议，在修改中也有进步，期待以后更好的课程，加油啊~"
    },
    {
        pic:"./img/job/13.jpg",
        name:'宋茜',
        content:"基础语法学习到二维数组，希望自己再接再厉，坚持学习，完成基础课程的学习，加油！ 对课程的总结有几点： 1、基础知识点讲解比较细致，易懂，哪怕你只有一点计算机基础，认真听完全可以听懂的。 2、知识点结合实例，趁热打铁，加深理解，锻炼动手编程能力 3、每小结的最后，有一两道结合已学知识点的编程题目，检验知识掌握程度，进一步加强自己实际解题能力，增强逻辑思维，这个最喜欢了。 4、课程内容和顺序安排的恰到好处，上一节课的结尾一般都会为下一节课的开始先做一个铺垫，这个很好。 5、老师课讲的很好，PPT和生动，每次看到吉祥物出现就有种莫名的激动，知道自己又完成了一个部分，哈哈。"
    },
    {
        pic:"./img/job/1.jpg",
        name:'马苏',
        content:"很佩服老师的写代码速度，作为一个老手，还能一个个知识点的敲代码看输出，给我们一个所见即所得学习感受，很容易记住，之前买过书，没看进去，听，老师一讲，就明白了，需要新手跟着老师敲一遍代码看输出，记得牢，时间久了，会明白每个知识点之间都是有联系的，基础语言部分是编程的核心，再难的部分都是0-1,1-n实现的，个人在这个教程中看到，语言其实是一个约定俗称解决抽象问题的一个具体表现，关键知识点在于原始概念的定义，因为这个定义产生的拓展或延伸，结合其他工具或者语言就可以完成强大的功能，我是一名其他行业的在岗人士，每天都会刷慕课，我相信，过不了多久，我就能完成我以前做不了的项目，坚持学习，梦想可期"
    },
    {
        pic:"./img/job/2.jpg",
        name:'蒋欣',
        content:"知识很系统，和看书完全不一样，语言这种东西，涉及到很多概念和来回的变化用文字的方式去表达的话很难搞清楚具体的应用。我是撸了两边书过来看的把书上的概念迅速的过一边。然后带着问题看视频，看看一些方法和对象是怎么应用和体现出来。课程很好，老师也讲的很细心。提问都有认真的回答。 唯一就是如果把练习和课程的视频分开就更好了。 快速播放这个太喜欢了。我个人是更2倍速度看所有内容过一遍。仔细的内容1.25倍或正常速度看。 和书本配合起来看效率不错的。当然最后还是要靠自己多练习。80%还是靠不断地联系去巩固知识。 总而言之挺好的。这是我第三次买慕课的课程了。"
    },

]
const problem = [
    {
        problemTitle:"打算学习PHP攻城狮路径，还需要学习Web前端攻城狮路径吗",
        problemCon:"你好，《网页搭建入门开发php》包含前端基础知识，对php来说是可以的了，如果想前后端都学，可以先学前端小白，再从《PHP从基础语法到原生项目开发 》学习php路径即可，祝您学习愉快~"
    },
    {
        problemTitle:"课程有时间限制的么",
        problemCon:"目前视频、教辅、ppt、源码是无限期的，服务是有期限的，教学服务包括问答、作业、习题等服务。详情参见：https://www.imooc.com/help/detail/87 祝：学习愉快！"
    },
    {
        problemTitle:"购买的0基础入门里面全部是教学视频吗",
        problemCon:"你好！除了视频以外，还有大量的习题、教辅和上传作业等内容。如果在学习中遇到问题，可以在问答区提问，我们的助教会帮助解决。感谢关注！"
    },
    {
        problemTitle:"做开发的话接着学哪个",
        problemCon:"同学如果想要做Java后台开发，可以继续学习《从网页搭建入门JavaWeb》，这个专题相对于《Java Web入门》多出了前端的知识，更适合小白用户。如果想要满足公司的实习岗位或者初级开发的岗位要求，还需要掌握数据库以及框架的知识，也就是Java职业路径阶段三和阶段四的课程知识。建议同学在学习过程中采用循序渐进的学习方法来进行，更有利于知识结构的掌握哟~~ 祝你成功，加油~~"
    },
    {
        problemTitle:"可以开发票么",
        problemCon:"你好！可以开发票的，具体可以看一下这个链接 https://www.imooc.com/help/detail/99 ，感谢关注！"
    },
    {
        problemTitle:"学完所有课程能中找到工作吗",
        problemCon:"学完Java路径的四个阶段课程，并且掌握之后，是可以满足企业实习生或者初级开发的岗位要求的，建议同学在学习过程中边学边练，更有利于知识的掌握，祝同学学业有成！"
    },

]